%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%   Azimut - Вычисление курса от точки u0 до точки u1
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function y = Azimut(u1, u0)
    % u0 - точка отсчета
    % u1 - конечная точка
    % la - долгота
    % fi - широта
    la1 = u0(2)*pi/180;
    fi1 = u0(1)*pi/180;
    la2 = u1(2)*pi/180;
    fi2 = u1(1)*pi/180;
    delta_la = la2-la1;
    y = atan2(sin(delta_la)*cos(fi2), cos(fi1)*sin(fi2)-sin(fi1)*cos(fi2)*cos(delta_la));
    y = rem((y + 2*pi), 2*pi);
end

    

