%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%   GPSPos2Speed - ќпределение скорости по сигналам GPS
%   u1 - “очка относительно, которой считаем перемещение (lat, lon, alt)
%   u0 - “очка до которой отладываем перемещение (lat, lon, alt)
%   time - ¬рем€ между замерами координат
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [v_lat, v_lon, v_alt] = GPSPos2Speed(u1, u0, time)
    un = u1-u0;
    v_lat = un(1)*40000/360*1000/time;
    v_lon = un(2)*(40000/360*1000/time * cos(pi/180*u0(1)));
    v_alt = un(3);
end