%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
%    Расчет параметров ветра по навигационному треугольнику скоростей
%
%   Обозначения:
%   W - Путевая скорость
%   V - Воздушная скорость
%   K - Курс
%   PU - Путевой курс
%   U - Скорость ветра
%   D - Направление ветра
%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [U, D, Ux, Uy] = SpeedTriangle2(V, W, K, PU)
    Ux = 0;
    Uy = 0;
    %% Определяем угол сноса
    US = PU - K;
    %% Курсовой угол ветра
    AC = W * sin(US); % вспомогательная сторона треугольника
    %% Определяем курсовой угол ветра
    %KUV = atan2(AC,W-V); - это приближение можно использовать для малых углов
    KUV = atan2(AC,W*cos(US)-V);
    %% Определяем модуль вектора ветра
    U = AC/sin(KUV);
    %% Определяем абсолютный угол ветра относительно севера
    D = K + KUV;
    % Разрешаем ему быть всегда только положительным
    if D > 2*pi 
        D = D - 2*pi;
    elseif D < 0
        D = D + 2*pi;
    end
end